mariopartyrd/marioparty4/src/REL/m408Dll/main.c
        case 2:
            Center.y = lbl_1_bss_54;
            lbl_1_bss_50 = -400.0f;
            ;
            lbl_1_bss_54 += lbl_1_bss_50 * REFRESH_FREQ;
            if (lbl_1_bss_1C < 0 && (MGSeqStatGet(lbl_1_bss_24) & 0x10)) {
                lbl_1_bss_1C = HuAudSeqPlay(74);
            }
            if (MGSeqStatGet(lbl_1_bss_24) == 0) {
                lbl_1_bss_60 = 3;
                object->objFunc = fn_1_CD8;
            }

            break;
    }
}

void fn_1_8020(void);

void fn_1_EF8(OMOBJ *object);

void fn_1_12A0(OMOBJ *object);

void fn_1_CD8(OMOBJ *object)
{
    Center.y = lbl_1_bss_54;
    lbl_1_bss_50 = -400.0f;
    lbl_1_bss_54 += lbl_1_bss_50 * REFRESH_FREQ;
    fn_1_8020();
    if (lbl_1_bss_4C == 0) {
        lbl_1_bss_48 = 1;
        lbl_1_bss_20 = MGSeqFinishCreate();
        MGSeqPosSet(lbl_1_bss_20, 320, 240);
        HuAudSeqFadeOut(lbl_1_bss_1C, 100);
        object->objFunc = fn_1_12A0;
    }
    else {
        if (lbl_1_bss_54 <= (-lbl_1_bss_50 * 0.5f)) {
            lbl_1_bss_20 = MGSeqFinishCreate();
            MGSeqPosSet(lbl_1_bss_20, 320, 240);
            HuAudSeqFadeOut(lbl_1_bss_1C, 100);
            lbl_1_bss_50 = -120.00001f;
            lbl_1_bss_54 = -lbl_1_bss_50 * 2.0f;
            lbl_1_bss_60 = 4;
            object->objFunc = fn_1_EF8;
        }
    }
}

void fn_1_18C0(OMOBJ *object);

void fn_1_EF8(OMOBJ *object)
{
    Vec sp30;
    Vec sp24;
    Vec sp18;
    Vec spC;
    float temp_f29;
    if (lbl_1_bss_10 < 0) {
        lbl_1_bss_10 = HuAudFXPlay(1360);
    }
    sp30.x = 0;
    sp30.y = 50;
    sp30.z = 230;
    temp_f29 = atan2d(lbl_1_bss_54 - sp30.y, sp30.z);
    if (temp_f29 < 0.0f) {
        temp_f29 += 360.0f;
    }
    Center.x = 0;
    Center.y = lbl_1_bss_54;
    Center.z = 0;
    CRot.x = temp_f29;
    CZoom = sqrtf((sp30.z * sp30.z) + ((lbl_1_bss_54 - sp30.y) * (lbl_1_bss_54 - sp30.y)));
    spC.x = 0;
    spC.z = 0;
    sp24.x = 200;
    sp24.z = 200;
    sp24.y = 800;
    spC.y = 20;
    sp18.x = sp18.y = 0;
    sp18.z = 1;
    Hu3DShadowPosSet(&sp24, &sp18, &spC);
    Hu3DShadowTPLvlSet(0.5f);
    lbl_1_bss_54 += lbl_1_bss_50 * REFRESH_FREQ;
    if (lbl_1_bss_54 <= 0.0f) {
        lbl_1_bss_54 = 0;
        lbl_1_bss_60 = 5;
        object->objFunc = fn_1_18C0;
    }
}

void fn_1_148C(OMOBJ *object);

void fn_1_12A0(OMOBJ *object)
{
    if (lbl_1_bss_54 > (-lbl_1_bss_50 * 0.8f)) {
        Center.y = lbl_1_bss_54;
        lbl_1_bss_50 = -400;
        lbl_1_bss_54 += lbl_1_bss_50 * REFRESH_FREQ;
    }
    if (MGSeqStatGet(lbl_1_bss_20)) {
        return;
    }
    switch (fn_1_CE68()) {
        case 0:
            OSReport("Map 0\n");
        case 1:
            OSReport("Map 1\n");
            if (lbl_1_bss_40 == 0) {
                WipeCreate(WIPE_MODE_OUT, WIPE_TYPE_NORMAL, REFRESH_RATE);
                lbl_1_bss_44 = 1;
            }
            object->objFunc = fn_1_148C;
            break;

        case 2:
            OSReport("Map 2\n");
        case 3:
            OSReport("Map 3\n");
            break;

        case 4:
            OSReport("Map 4\n");
            if (lbl_1_bss_40 == 0) {
                WipeCreate(WIPE_MODE_OUT, WIPE_TYPE_NORMAL, REFRESH_RATE / 2);
                lbl_1_bss_44 = 1;
            }
            object->objFunc = fn_1_148C;
            break;
    }
}

void fn_1_148C(OMOBJ *object)
{
    Vec sp30;
    Vec sp24;
    Vec sp18;
    Vec spC;
    float temp_f29;
    if (!WipeStatGet()) {
        lbl_1_bss_54 = 0;
        sp30.x = 0;
        sp30.y = 50;
        sp30.z = 230;
        temp_f29 = atan2d(lbl_1_bss_54 - sp30.y, sp30.z);
        if (temp_f29 < 0.0f) {
            temp_f29 += 360.0f;
        }
        Center.x = 0;
        Center.y = lbl_1_bss_54;
        Center.z = 0;
        CRot.x = temp_f29;
        CZoom = sqrtf((sp30.z * sp30.z) + ((lbl_1_bss_54 - sp30.y) * (lbl_1_bss_54 - sp30.y)));
        spC.x = 0;
        spC.z = 0;
        sp24.x = 200;
        sp24.z = 200;
        sp24.y = 800;
        spC.y = 20;
        sp18.x = sp18.y = 0;
        sp18.z = 1;
        Hu3DShadowPosSet(&sp24, &sp18, &spC);
        Hu3DShadowTPLvlSet(0.5f);
        fn_1_CEEC();
        if (lbl_1_bss_10 < 0) {
            lbl_1_bss_10 = HuAudFXPlay(1360);
        }
        if (lbl_1_bss_40 == 0) {
            WipeCreate(WIPE_MODE_IN, WIPE_TYPE_NORMAL, REFRESH_RATE / 2);
            lbl_1_bss_44 = 0;
        }
        lbl_1_bss_60 = 5;
        object->objFunc = fn_1_18C0;
    }
    else {
        if (lbl_1_bss_54 > (-lbl_1_bss_50 * 0.8f)) {
            Center.y = lbl_1_bss_54;
            lbl_1_bss_50 = -400;
            lbl_1_bss_54 += lbl_1_bss_50 * REFRESH_FREQ;
        }
    }
}

void fn_1_18C0(OMOBJ *object)
{
    if (!WipeStatGet() && lbl_1_bss_14 < 0) {
        if (lbl_1_bss_C) {
            lbl_1_bss_14 = HuAudSStreamPlay(1);
        }
        else {
            lbl_1_bss_14 = HuAudSStreamPlay(4);
        }
    }
}

float lbl_1_data_A0[] = { 7, 7, 7, 7, 7, 7, 7, 7, 7, 7 };

void fn_1_1940(Work2FAC *arg0, Vec *arg1)
{
    Mtx sp18;
    Vec spC;
    spC.x = sind(arg0->unk58.x + 90.0f);
    spC.y = 0;
    spC.z = cosd(arg0->unk58.x + 90.0f);
    MTXRotAxisDeg(sp18, &spC, arg0->unk58.y);
    spC.x = spC.z = 0;
    spC.y = -lbl_1_data_A0[arg0->unk2];
    MTXMultVec(sp18, &spC, arg1);
}

void fn_1_1A60(Vec *arg0, Vec *arg1, Vec *arg2, Vec *arg3)
{
    Mtx spC;
    mtxRot(spC, arg1->x, arg1->y, arg1->z);
    MTXMultVec(spC, arg2, arg3);
    arg3->x += arg0->x;
    arg3->y += arg0->y;
    arg3->z += arg0->z;
}

void fn_1_1AF8(Work2FAC *arg0, s32 arg1, Vec *arg2)
{
    float temp_f31;
    float temp_f30;
    temp_f30 = temp_f31 = 0;
    arg2->x = (temp_f31 * sind(temp_f30)) + arg0->unk1C.x;
    arg2->y = 15.0f + arg0->unk1C.y + temp_f31;
    arg2->z = (temp_f31 * cosd(temp_f30)) + arg0->unk1C.z;
}

void fn_1_1BE8(OMOBJ *arg0, float arg1)
{
    Vec sp8;
    Work2FAC *temp_r31 = arg0->data;
    float temp_f31 = 1.0f - arg1;
    float temp_f29;
    if (!temp_r31->unk8) {
        return;
    }
    fn_1_1AF8(temp_r31, 1, &sp8);
    if (fn_1_6878() >= 4) {
        sp8.z += -5.0f;
    }
    temp_r31->unk94.x = (temp_r31->unk94.x * temp_f31) + (sp8.x * arg1);
    temp_r31->unk94.y = (temp_r31->unk94.y * temp_f31) + (sp8.y * arg1);
    temp_r31->unk94.z = (temp_r31->unk94.z * temp_f31) + (sp8.z * arg1);
    temp_f29 = (0.1f * ((temp_r31->unk8 * 0.5f) + 0.5f)) * arg1;
    temp_r31->unkA0.x = temp_r31->unkC * (temp_f29 + (temp_r31->unkA0.x * temp_f31));
    temp_r31->unkA0.y = temp_r31->unkC * (temp_f29 + (temp_r31->unkA0.y * temp_f31));
    temp_r31->unkA0.z = temp_r31->unkC * (temp_f29 + (temp_r31->unkA0.z * temp_f31));
    Hu3DModelPosSetV(arg0->mdlId[1], &temp_r31->unk94);
    Hu3DModelScaleSetV(arg0->mdlId[1], &temp_r31->unkA0);
}

void fn_1_1E54(OMOBJ *object)
{
    Work2FAC *work = object->data;
    if (work->unk8) {
#if VERSION_PAL
        work->unk94.y += 0.59999999f; // supposedly 0.6f
#else
        work->unk94.y += 0.5f;
#endif
        Hu3DModelPosSetV(object->mdlId[1], &work->unk94);
    }
}

