mariopartyrd/marioparty4/src/REL/m408Dll/main.c
s32 fn_1_1EBC(OMOBJ *object)
{
    float temp_f31;
    float temp_f22;
    float temp_f21;
    Vec sp3C;
    Vec sp30;
    Vec sp24;

    Work2FAC *temp_r31 = object->data;
    temp_f31 = (temp_r31->unk1C.x * temp_r31->unk1C.x) + ((10.0f / 7.0f) * ((10.0f / 7.0f) * temp_r31->unk1C.z * temp_r31->unk1C.z));
    if (temp_f31 > 6400) {
        temp_f22 = 80.0f / sqrtf(temp_f31);
        sp3C.x = temp_r31->unk1C.x * temp_f22;
        sp3C.z = temp_r31->unk1C.z * temp_f22;
        temp_r31->unk34.x = sp3C.x - temp_r31->unk1C.x;
        temp_r31->unk34.z = sp3C.z - temp_r31->unk1C.z;
        temp_f21 = 80.0f * sqrtf(0.51f);
        sp30.x = temp_f21 - sp3C.x;
        sp30.z = -sp3C.z;
        sp24.x = -temp_f21 - sp3C.x;
        sp24.z = -sp3C.z;
        temp_f31 = 1.0f / VECMagXZ(&sp30);
        sp30.x *= temp_f31;
        sp30.z *= temp_f31;
        temp_f31 = 1.0f / VECMagXZ(&sp24);
        sp24.x *= temp_f31;
        sp24.z *= temp_f31;
        sp30.x += sp24.x;
        sp30.z += sp24.z;
        temp_f31 = 1.0f / VECMagXZ(&sp30);
        sp30.x *= temp_f31;
        sp30.z *= temp_f31;
        temp_f22 = -((sp30.x * temp_r31->unk28.x) + (sp30.z * temp_r31->unk28.z));
        temp_r31->unk28.x += (sp30.x * 20.0f) + (sp30.x * 2.0f * temp_f22);
        temp_r31->unk28.z += (sp30.z * 20.0f) + (sp30.z * 2.0f * temp_f22);
        return 1;
    }
    else {
        return 0;
    }
}

void fn_1_26E4(OMOBJ *object);
void fn_1_61FC(OMOBJ *object);

void fn_1_25D4(HUPROCESS *objman)
{
    s32 i;
    omMakeGroupEx(objman, 0, 4);
    lbl_1_bss_6C = omGetGroupMemberListEx(objman, 0);
    lbl_1_bss_58 = 0;
    for (i = 0; i < 4; i++) {
        OMOBJ *object = omAddObjEx(objman, 40, 5, 7, 0, fn_1_26E4);
        if (!GWPlayerCfg[i].iscom) {
            lbl_1_bss_58++;
        }
        object->work[0] = i;
    }
    lbl_1_bss_8 = omAddObjEx(objman, 10, 0, 0, -1, fn_1_61FC);
}

s32 lbl_1_data_C8[] = {
    DATA_MAKE_NUM(DATADIR_M408, 0x02),
    DATA_MAKE_NUM(DATADIR_M408, 0x03),
    DATA_MAKE_NUM(DATADIR_M408, 0x04),
    DATA_MAKE_NUM(DATADIR_M408, 0x05),
    DATA_MAKE_NUM(DATADIR_M408, 0x06),
    DATA_MAKE_NUM(DATADIR_M408, 0x07),
    DATA_MAKE_NUM(DATADIR_M408, 0x08),
    DATA_MAKE_NUM(DATADIR_M408, 0x09),
};

u32 lbl_1_data_E8[] = {
    0,
    23,
    24,
    DATA_MAKE_NUM(DATADIR_M408, 0x2C),
    DATA_MAKE_NUM(DATADIR_M408, 0x3C),
    DATA_MAKE_NUM(DATADIR_M408, 0x34),
    22,
};

float lbl_1_data_104[][2] = { -40, -30, 40, -30, -40, 30, 40, 30 };

float lbl_1_data_124[][2] = { 0, -56, 0, 56, -80, 0, 80, 0 };

void fn_1_2FAC(OMOBJ *object);
void fn_1_5AB4(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix);

void fn_1_26E4(OMOBJ *object)
{
    Work2FAC *temp_r31;
    s32 temp_r28;
    s32 temp_r27;

    float sp20[4] = { 0.25, 0.5, 0.75, 1.0 };
    object->data = HuMemDirectMallocNum(HEAP_HEAP, sizeof(Work2FAC), HU_MEMNUM_OVL);
    temp_r31 = object->data;
    memset(temp_r31, 0, sizeof(Work2FAC));
    temp_r31->unk0 = object->work[0];
    temp_r31->unk2 = GWPlayerCfg[temp_r31->unk0].character;
    temp_r31->unk2 &= 0x7;
    temp_r31->unk4 = 0;
    temp_r31->unk90 = sp20[GWPlayerCfg[object->work[0]].diff & 0x3];
    temp_r31->unk1C.x = lbl_1_data_104[temp_r31->unk0][0];
    temp_r31->unk1C.y = lbl_1_bss_54;
    temp_r31->unk1C.z = lbl_1_data_104[temp_r31->unk0][1];
    temp_r31->unk28.x = temp_r31->unk28.y = temp_r31->unk28.z = 0;
    temp_r31->unk34.x = temp_r31->unk34.y = temp_r31->unk34.z = 0;
    temp_r31->unk58.y = 0;
    temp_r31->unk58.x = 0;
    temp_r31->unk4C.x = temp_r31->unk4C.y = temp_r31->unk4C.z = 0;
    temp_r31->unk58.z = 9.0f;
    temp_r31->unk40.x = temp_r31->unk40.y = temp_r31->unk40.z = 0;
    temp_r31->unk8 = 4;
    temp_r31->unkC = 0;
    fn_1_1940(temp_r31, &temp_r31->unk68);
    omSetTra(object, temp_r31->unk1C.x + temp_r31->unk68.x, temp_r31->unk1C.y + temp_r31->unk68.y, temp_r31->unk1C.z + temp_r31->unk68.z);
    omSetSca(object, 0.075f, 0.075f, 0.075f);
    object->mdlId[0] = CharModelCreate(temp_r31->unk2, 4);
    for (temp_r28 = 0; temp_r28 < 7; temp_r28++) {
        if (lbl_1_data_E8[temp_r28] < 0x10000) {
            object->mtnId[temp_r28] = CharMotionCreate(temp_r31->unk2, lbl_1_data_E8[temp_r28]);
        }
        else {
            object->mtnId[temp_r28] = Hu3DJointMotionFile(object->mdlId[0], temp_r31->unk2 + lbl_1_data_E8[temp_r28]);
        }
    }
    CharMotionVoiceOnSet(temp_r31->unk2, object->mtnId[1], 0);
    CharMotionShiftSet(temp_r31->unk2, object->mtnId[0], 0, 0.2, HU3D_MOTATTR_LOOP);
    CharEffectLayerSet(2);
    CharMotionDataClose(temp_r31->unk2);
    object->mdlId[1] = Hu3DModelCreateFile(lbl_1_data_C8[temp_r31->unk2]);
    Hu3DModelLayerSet(object->mdlId[1], 6);
    Hu3DModelScaleSet(object->mdlId[1], 0.1f * temp_r31->unk8, 0.1f * temp_r31->unk8, 0.1f * temp_r31->unk8);
    Hu3DModelAttrSet(object->mdlId[1], HU3D_ATTR_DISPOFF);
    temp_r31->unk94.x = temp_r31->unk94.y = temp_r31->unk94.z = 0;
    temp_r31->unkA0.x = temp_r31->unkA0.y = temp_r31->unkA0.z = 0;
    fn_1_1BE8(object, 1.0f);
    temp_r27 = Hu3DParticleCreate(HuSprAnimReadFile(DATA_MAKE_NUM(DATADIR_M408, 0x24)), 256);
    object->mdlId[2] = temp_r27;
    Hu3DModelLayerSet(temp_r27, 6);
    Hu3DParticleColSet(temp_r27, 255, 255, 255);
    Hu3DParticleHookSet(temp_r27, fn_1_5AB4);
    Hu3DModelPosSet(temp_r27, 0, 0, 0);
    ((HU3DPARTICLE *)Hu3DData[temp_r27].hookData)->dataCnt = 0;
    temp_r31->unk74 = temp_r31->unk78 = 0;
    temp_r31->unk7C[0] = temp_r31->unk7C[1] = 0;
    temp_r31->unk8C = -1;
    temp_r31->unk8E = 0;
    temp_r31->unk84[0] = temp_r31->unk84[1] = 0;
    object->work[1] = 0;
    object->objFunc = fn_1_2FAC;
}

void fn_1_5DCC(s32 arg0, Vec *arg1, u32 arg2);
void fn_1_3E80(OMOBJ *object);

void fn_1_2FAC(OMOBJ *object)
{
    Work2FAC *temp_r31 = object->data;
    Vec sp78[] = { { 8, -25, -18 }, { 2, -25, -10 }, { 2, -25, -24 }, { -3, -25, -15 } };
    Vec sp3C;
    Vec sp30;
    Vec sp24;
    float sp14[] = { 45, 135, 225, 315 };
    float temp_f27;
    switch (object->work[1]) {
        case 0:
            fn_1_C3C0(&sp3C, &sp30);
            fn_1_1A60(&sp3C, &sp30, &sp78[temp_r31->unk0], &sp24);
            omSetRot(object, 0, 90, 0);
            omSetTra(object, sp24.x, sp24.y, sp24.z);
            if (fn_1_C43C() != 1) {
                object->work[1]++;
                temp_r31->unk58.y = 60;
                temp_r31->unk58.x = sp14[temp_r31->unk0];
                temp_r31->unk28.x = temp_r31->unk28.y = temp_r31->unk28.z = 0;
                object->trans.x -= 10.0 * (2.0 * sind(temp_r31->unk58.x));
                object->trans.z -= 10.0 * (2.0 * cosd(temp_r31->unk58.x));
                CharMotionShiftSet(temp_r31->unk2, object->mtnId[4], 0, 0.2, HU3D_MOTATTR_LOOP);
                temp_r31->unk1C.x = temp_r31->unk94.x = object->trans.x;
                temp_r31->unk1C.y = temp_r31->unk94.y = object->trans.y;
                temp_r31->unk1C.z = temp_r31->unk94.z = object->trans.z;
            }
            break;

        case 1:
            temp_r31->unk28.y += -98.0f;
            if (temp_r31->unk28.y < -400.0f) {
                temp_r31->unk28.y = -400.0f;
            }
            temp_f27 = object->trans.y;
            object->trans.y += temp_r31->unk28.y * REFRESH_FREQ;
#if VERSION_PAL
            temp_r31->unk58.x += 1.8f;
#else
            temp_r31->unk58.x += 1.5000001f;
#endif
            if (temp_r31->unk58.x >= 360.0f) {
                temp_r31->unk58.x -= 360.0f;
            }
            object->trans.x += (3.141590118408203f * (10.0 * sind(temp_r31->unk58.x - 90.0f))) * REFRESH_FREQ;
            object->trans.z += (3.141590118408203f * (10.0 * cosd(temp_r31->unk58.x - 90.0f))) * REFRESH_FREQ;
            if (temp_f27 > 12000 && object->trans.y <= 12000) {
                sp3C.x = object->trans.x;
                sp3C.y = object->trans.y;
                sp3C.z = object->trans.z;
                fn_1_5DCC(object->mdlId[2], &sp3C, 100);
            }
            temp_r31->unk4C.x = temp_r31->unk58.y;
            temp_r31->unk4C.y = temp_r31->unk58.x;
            temp_r31->unk4C.z = 0;
            temp_r31->unk1C.x = object->trans.x;
            temp_r31->unk1C.y = object->trans.y;
            temp_r31->unk1C.z = object->trans.z;
            omSetRot(object, temp_r31->unk4C.x, temp_r31->unk4C.y, temp_r31->unk4C.z);
            Hu3DModelAttrReset(object->mdlId[1], HU3D_ATTR_DISPOFF);
            temp_r31->unkC += 0.2f * (1.0f - temp_r31->unkC);
            if (object->trans.y < 11940) {
                object->work[1]++;
            }
            break;
    }
    fn_1_1BE8(object, 1.0f);
    if (fn_1_6878() == 1) {
        omSetSca(object, 0.15f, 0.15f, 0.15f);
        object->trans.x = temp_r31->unk1C.x = temp_r31->unk94.x = lbl_1_data_104[temp_r31->unk0][0];
        object->trans.y = temp_r31->unk1C.y = temp_r31->unk94.y = lbl_1_bss_54;
        object->trans.z = temp_r31->unk1C.z = temp_r31->unk94.z = lbl_1_data_104[temp_r31->unk0][1];
        object->rot.y = temp_r31->unk58.x = atan2d(object->trans.x, object->trans.z) + 180.0;
        Hu3DModelAttrReset(object->mdlId[1], HU3D_ATTR_DISPOFF);
        ((HU3DPARTICLE *)Hu3DData[object->mdlId[2]].hookData)->dataCnt = 0;
        object->objFunc = fn_1_3E80;
    }
}

void fn_1_38D0(OMOBJ *arg0, s8 *arg1, s8 *arg2)
{
    float temp_f31;
    float temp_f30;
    float temp_f29;
    Work2FAC *temp_r31;
    Work2FAC *temp_r30;
    s8 temp_r29;
    s32 temp_r28;
    s32 temp_r25;
    Vec sp18;
    Vec spC;
    s8 sp8[4];

    temp_r31 = arg0->data;
    *arg1 = temp_r31->unk7C[0];
    *arg2 = temp_r31->unk7C[1];
    sp18.x = temp_r31->unk1C.x;
    sp18.y = temp_r31->unk1C.y;
    sp18.z = temp_r31->unk1C.z;
    temp_r25 = fn_1_162CC(&sp18, &spC);
    temp_r29 = 0;
    sp8[0] = -1;
    for (temp_r28 = 0; temp_r28 < 4; temp_r28++) {
        if (temp_r28 != temp_r31->unk0) {
            temp_r30 = fn_1_68A8(temp_r28);
            if ((temp_r30->unk4 & 0x12) == 0) {
                sp8[temp_r29++] = temp_r28;
            }
        }
    }
    switch (temp_r31->unk8E) {
        case 0:
            if (temp_r29 > 0 || temp_r25) {
                if (temp_r29 > 0) {
                    temp_r31->unk8C = sp8[frandmod(temp_r29)];
                }
#if VERSION_PAL
                temp_r31->unk74 = frandmod(150) + 100.0f;
#else
                temp_r31->unk74 = frandmod(180) + 120.0f;
#endif
                temp_r31->unk78 = 0;
                temp_r31->unk8E = 1;
            }
            else {
                temp_r31->unk78 = 0;
                temp_r31->unk8E = 2;
            }
            break;

        case 1:
            if ((temp_r31->unk78 & 0x3) == 0) {
                if (temp_r25) {
                    temp_f31 = atan2d(spC.x - temp_r31->unk1C.x, spC.z - temp_r31->unk1C.z);
                }
                else {
                    temp_r30 = fn_1_68A8(temp_r31->unk8C);
                    temp_f31 = atan2d(temp_r30->unk1C.x - temp_r31->unk1C.x, temp_r30->unk1C.z - temp_r31->unk1C.z);
                }
                temp_r31->unk84[1] = fn_1_883C(temp_r31->unk84[0], temp_f31, (0.3f * temp_r31->unk90) + 0.15f);
            }
            temp_r31->unk78++;
            temp_r31->unk84[0] = fn_1_883C(temp_r31->unk84[0], temp_r31->unk84[1], 0.2f);
            temp_r31->unk7C[0] = sind(temp_r31->unk84[0]) * 80.0;
            temp_r31->unk7C[1] = -cosd(temp_r31->unk84[0]) * 80.0;
            *arg1 = temp_r31->unk7C[0];
            *arg2 = temp_r31->unk7C[1];
            temp_r31->unk74--;
            if (temp_r25 == 0 && (temp_r30->unk4 & 0x12)) {
                temp_r31->unk74 = 0;
            }
            if (temp_r31->unk74 == 0) {
                temp_r31->unk8E = 0;
            }
            break;

