mariopartyrd/marioparty4/src/REL/m408Dll/main.c
    temp_r29 = object->data;
    object->trans.x = lbl_1_data_144[object->work[0]].x;
    object->trans.z = lbl_1_data_144[object->work[0]].z;
    if (object->work[1] == 0) {
        if (lbl_1_bss_3C < temp_r29->unk8) {
            lbl_1_bss_3C = temp_r29->unk8;
        }
    }
    else if (object->work[1] == 10 && lbl_1_bss_3C == temp_r29->unk8) {
        for (temp_r27 = 0; lbl_1_bss_28[temp_r27] >= 0; temp_r27++)
            ;
        lbl_1_bss_28[temp_r27] = temp_r29->unk2;
    }
    object->work[1]++;
    temp_r29->unk1C.y = lbl_1_bss_54;
    temp_r29->unk58.y = 0;
    temp_r29->unk58.x = 0;
    object->rot.x = object->rot.y = object->rot.z = 0;
    object->trans.y = temp_r29->unk1C.y;
    temp_r29->unk1C.x = object->trans.x;
    temp_r29->unk1C.z = object->trans.z;
    temp_r29->unk1C.y += lbl_1_data_A0[temp_r29->unk2];
    if (object->trans.y < 0) {
        object->trans.y = 0;
    }
    fn_1_1BE8(object, 1.0f);
    if (fn_1_6878() == 5) {
        object->objFunc = fn_1_54E4;
        if (temp_r29->unk14) {
            lbl_1_bss_C = 1;
        }
    }
}

void fn_1_54E4(OMOBJ *object)
{
    Work2FAC *temp_r30 = object->data;
    fn_1_1E54(object);
    if (!(temp_r30->unk4 & 0x8)) {
        temp_r30->unk4 |= 0x8;
        if (temp_r30->unk14 != 0) {
            CharMotionShiftSet(temp_r30->unk2, object->mtnId[1], 0, 0.2f, HU3D_MOTATTR_NONE);
            CharFXPlay(temp_r30->unk2, 290);
            GWPlayerCoinCollectAdd(object->work[0], temp_r30->unk14);
        }
        else {
            CharMotionShiftSet(temp_r30->unk2, object->mtnId[2], 0, 0.2f, HU3D_MOTATTR_NONE);
        }
        object->work[1] = 0;
    }
    else if (object->work[1] == 0 && Hu3DMotionEndCheck(object->mdlId[0])) {
        lbl_1_bss_4C--;
        object->work[1]++;
    }
}

void fn_1_5AA0(OMOBJ *object);

void fn_1_5684(OMOBJ *object)
{
    Work2FAC *temp_r31;
    s32 temp_r29;
    temp_r31 = object->data;
    if (fabs(object->trans.x) < 160.0 || fabs(object->trans.z) < 160.0) {
        temp_r31->unk1C.x += temp_r31->unk28.x * REFRESH_FREQ;
        temp_r31->unk1C.z += temp_r31->unk28.z * REFRESH_FREQ;
#if VERSION_PAL
        temp_r31->unk58.x += 10.8f;
#else
        temp_r31->unk58.x += 9.0f;
#endif
        if (temp_r31->unk58.x >= 360.0f) {
            temp_r31->unk58.x -= 360.0f;
        }
        temp_r31->unk58.y = 0.9f * temp_r31->unk58.y;
        temp_r31->unk4C.x = 90.0f + temp_r31->unk58.y;
        temp_r31->unk4C.y = temp_r31->unk58.x;
        temp_r31->unk4C.z = 0;
        omSetRot(object, temp_r31->unk4C.x, temp_r31->unk4C.y, temp_r31->unk4C.z);
        fn_1_1940(temp_r31, &temp_r31->unk68);
        omSetTra(object, temp_r31->unk1C.x + temp_r31->unk68.x, temp_r31->unk1C.y + temp_r31->unk68.y, temp_r31->unk1C.z + temp_r31->unk68.z);
    }
    if (fn_1_6878() >= 4) {
        GWPlayerCoinCollectAdd(object->work[0], temp_r31->unk14);
        if (lbl_1_bss_48) {
            Hu3DModelAttrReset(object->mdlId[0], HU3D_ATTR_DISPOFF);
            CharMotionSet(temp_r31->unk2, object->mtnId[6]);
            Hu3DModelAttrSet(object->mdlId[0], HU3D_MOTATTR_LOOP);
            object->trans.x = lbl_1_data_144[object->work[0]].x;
            object->trans.y = 0;
            object->trans.z = lbl_1_data_144[object->work[0]].z;
            object->rot.x = object->rot.y = object->rot.z = 0;
        }
        else {
            Hu3DModelAttrSet(object->mdlId[0], HU3D_ATTR_DISPOFF);
        }

        for (temp_r29 = 0; temp_r29 < 4; temp_r29++) {
            Hu3DModelAttrSet(object->mdlId[1], HU3D_ATTR_DISPOFF);
        }
        object->objFunc = fn_1_5AA0;
    }
}

void fn_1_5AA0(OMOBJ *object)
{
    Work2FAC *sp8 = object->data;
}

void fn_1_5AB4(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    HU3DPARTICLEDATA *temp_r31;
    s32 temp_r29;
    float temp_f31;
    if (particle->dataCnt == 0) {
        particle->dataCnt++;
        temp_r31 = particle->data;
        for (temp_r29 = 0; temp_r29 < particle->maxCnt; temp_r29++, temp_r31++) {
            temp_r31->time = 0;
            temp_r31->scale = 0;
            temp_r31->color.a = 0;
        }
        return;
    }
    temp_r31 = particle->data;
    for (temp_r29 = 0; temp_r29 < particle->maxCnt; temp_r29++, temp_r31++) {
        if (temp_r31->time == 0 || temp_r31->time != 1) {
            continue;
        }
        temp_r31->parManId++;
#if VERSION_PAL
        temp_f31 = temp_r31->parManId - 8.5f;
#else
        temp_f31 = temp_r31->parManId - 10.2f;
#endif
        if (temp_f31 < 0.0f) {
            temp_r31->pos.x += (temp_r31->vel.x - temp_r31->pos.x) * 0.2f;
            temp_r31->pos.y += (temp_r31->vel.y - temp_r31->pos.y) * 0.15f;
            temp_r31->pos.z += (temp_r31->vel.z - temp_r31->pos.z) * 0.2f;
            temp_r31->scale += (temp_r31->accel.x - temp_r31->scale) * 0.2f;
            temp_r31->accel.y += (temp_r31->accel.z - temp_r31->accel.y) * 0.2f;
            temp_r31->color.a = temp_r31->accel.y;
        }
        else {
            temp_r31->pos.x += (temp_r31->speedDecay * 1.5f) * REFRESH_FREQ;
            temp_r31->pos.y += (temp_r31->colorIdx * 1.5f) * REFRESH_FREQ;
            temp_r31->pos.z += (temp_r31->scaleBase * 1.5f) * REFRESH_FREQ;
            temp_r31->scale += (temp_r31->accel.x * 0.01f);
            temp_r31->color.a = 0.92f * temp_r31->color.a;
        }
    }
    DCStoreRange(particle->data, particle->maxCnt * sizeof(HU3DPARTICLEDATA));
}

void fn_1_5DCC(s32 arg0, Vec *arg1, u32 arg2)
{
    float temp_f31;
    float temp_f30;

    HU3DPARTICLEDATA *temp_r31;
    HU3DPARTICLE *temp_r29;
    s32 temp_r28;
    temp_r29 = Hu3DData[arg0].hookData;
    if (temp_r29->dataCnt != 0) {
        temp_r31 = temp_r29->data;
        for (temp_r28 = 0; temp_r28 < temp_r29->maxCnt; temp_r28++, temp_r31++) {
            if (temp_r31->time) {
                continue;
            }
            temp_r31->time = 1;
            temp_r31->parManId = 0;
            temp_r31->pos.x = arg1->x;
            temp_r31->pos.y = 11990;
            temp_r31->pos.z = arg1->z;
            temp_f31 = frandmod(1000) * (1.0f / 1000.0f);
            temp_f30 = frandmod(1000) * (360.0f / 1000.0f);
            temp_r31->speedDecay = 10 * (0.8f * (temp_f31 * sind(temp_f30)));
            temp_r31->colorIdx = 10.0f * (5.0f * (1.0f - (temp_f31 * temp_f31)));
            temp_r31->scaleBase = 10 * (0.8f * (temp_f31 * cosd(temp_f30)));
            temp_r31->vel.x = temp_r31->speedDecay + arg1->x;
            temp_r31->vel.y = temp_r31->colorIdx + temp_r31->pos.y;
            temp_r31->vel.z = temp_r31->scaleBase + arg1->z;
            temp_r31->accel.x = (6.0f + (0.012f * frandmod(1000)));
            temp_r31->scale = 2.0f;
            temp_r31->accel.y = temp_r31->color.a = 10;
            temp_r31->accel.z = frandmod(100) + 64;
            temp_f31 = 0.00040000002f * frandmod(1000);
            temp_f31 += 0.6f * cosd(temp_f30);
            temp_r31->color.r = (55 * temp_f31) + 200;
            temp_r31->color.g = (50 * temp_f31) + 205;
            temp_r31->color.b = (5 * temp_f31) + 250;
            if (--arg2 == 0) {
                break;
            }
        }
    }
}

typedef struct work_61FC {
    s32 unk0;
    s32 unk4;
    u32 unk8;
    float unkC[2];
    s32 unk14;
    s32 unk18;
    s32 unk1C[7];
    float unk38[7];
    s16 unk54[7];
} Work61FC;

void fn_1_6540(OMOBJ *object);

void fn_1_61FC(OMOBJ *object)
{
    Work61FC *temp_r31;
    s32 temp_r30;
    s32 temp_r28;
    s32 temp_r26;

